src/index.org
#+options: html-link-use-abs-url:nil html-postamble:auto
#+options: html-preamble:t html-scripts:nil html-style:t
#+options: html5-fancy:nil tex:t
#+options: num:0 toc:nil
#+options: author:nil timestamp:nil
#+html_doctype: xhtml-strict
#+html_container: div
#+html_content_class: content
#+description:
#+keywords:
#+html_link_home:
#+html_link_up:
#+html_mathjax:
#+html_equation_reference_format: \eqref{%s}
#+html_head_extra:
#+infojs_opt:
#+creator: <a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.2.50 (<a href="https://orgmode.org">Org</a> mode 9.5.5)
#+latex_header:
#+LANGUAGE: ar
#+AUTHOR: Mahmoud Nagy Adam
#+EMAIL: mnagy1312@gamil.com
#+SETUPFILE: ./css/white_clean.theme
#+SETUPFILE: ./css/main_header.org
#+TITLE: خواطر ناجي
#+OPTIONS: title:nil
#+HTML_HEAD: <style type="text/css">p {
#+HTML_HEAD:    color: #888;
#+HTML_HEAD:    font-size:  15px;
#+HTML_HEAD:    margin:  0 0 10px;
#+HTML_HEAD: }
#+HTML_HEAD:</style>

* الخواطر:

** [[file:posts/rehlt-dvorak/rehlt-dvorak.org][رحلتي من الكويرتي الي الدفوراك]]
لاشك أن لوحة مفاتيح الكويرتي في الكتابة هي الاكثر استخداماً في العالم،
وهي الاشهر، وقد يتخيلها معظم الناس انها لوحة المفاتيح الانجليزية
الوحيدة لشهرتها، ولكن العجيب في ذلك انها ليست أفضل لوحة مفاتيح، لا في
السرعة، ولا في توزيع الأزرار...

** [[file:posts/c-use-class/c-use-class.org][استخدام البرمجة كائنية التوجه مع السي]]
البرمجة كائنية التوجه (OOP) هي نوع برمجة مستخدم بشدة في كل لغات
البرمجة الحديثة، ولكن كما هو معروف السي لغة قائمة على البرمجة الوظيفية
(Functional programming)، واحيانا تطبيق بعض أفكار البرمجة الكائنية في
السي يحسن كثيرا فاعلية الكود وهيئته، ونرى ذلك في كود لينكس...
