index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ar" xml:lang="ar">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>خواطر ناجي</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Aref+Ruqaa">
<link rel="stylesheet"
href="https://unpkg.com/@highlightjs/cdn-assets@11.7.0/styles/default.min.css">
<div class="header">
<a href="index.html" class="logo" >خواطر ناجي</a>
<br>
<a href="index.html" class="page_hover">الخواطر</a>
<a href="about.html" class="page_hover">عن المدونة</a>
<a href="aboutme.html" class="page_hover">عني</a>
</div>
</head>
<body>
<div id="content" class="content">

<div id="outline-container-org1034e53" class="outline-2">
<h2 id="org1034e53">الخواطر:</h2>
<div class="outline-text-2" id="text-org1034e53">
</div>
<div id="outline-container-orgca53277" class="outline-3">
<h3 id="orgca53277"><a href="posts/rehlt-dvorak/rehlt-dvorak.html">رحلتي من الكويرتي الي الدفوراك</a></h3>
<div class="outline-text-3" id="text-orgca53277">
<p>
لاشك أن لوحة مفاتيح الكويرتي في الكتابة هي الاكثر استخداماً في العالم،
وهي الاشهر، وقد يتخيلها معظم الناس انها لوحة المفاتيح الانجليزية
الوحيدة لشهرتها، ولكن العجيب في ذلك انها ليست أفضل لوحة مفاتيح، لا في
السرعة، ولا في توزيع الأزرار&#x2026;
</p>
</div>
</div>

<div id="outline-container-orgf5b2276" class="outline-3">
<h3 id="orgf5b2276"><a href="posts/c-use-class/c-use-class.html">استخدام البرمجة كائنية التوجه مع السي</a></h3>
<div class="outline-text-3" id="text-orgf5b2276">
<p>
البرمجة كائنية التوجه (OOP) هي نوع برمجة مستخدم بشدة في كل لغات
البرمجة الحديثة، ولكن كما هو معروف السي لغة قائمة على البرمجة الوظيفية
(Functional programming)، واحيانا تطبيق بعض أفكار البرمجة الكائنية في
السي يحسن كثيرا فاعلية الكود وهيئته، ونرى ذلك في كود لينكس&#x2026;
</p>
</div>
</div>
</div>
</div>
</body>
</html>
